.emacs.d/config.org
#+TITLE: Emacs Config
#+AUTHOR: Mikolaj Gawrys
#+STARTUP: showeverything
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

* Table of Contents
- [[Custom]]
- [[Packages]]
- [[General]]
- [[Basic UI config]]
  - [[Theme and Font]]
  - [[Dashboard]]
- [[Keybindings]]
  - [[Evil]]
  - [[Hydra]]
- [[Navigation]]
  - [[Ivy]]
  - [[Project]]
  - [[Tab Bar and Window Management]]
- [[Dired]]
- [[Org]]
  - [[Org Agenda]]
  - [[Babel]]
- [[Terminal]]
- [[Magit]]
- [[PDF]]
- [[Eglot]]

* Custom
-----
#+begin_src emacs-lisp
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(custom-safe-themes
   '("48042425e84cd92184837e01d0b4fe9f912d875c43021c3bcb7eeb51f1be5710" default))
 '(package-selected-packages
   '(visual-fill-column org-bullets latex vterm page-break-lines counsel-projectile projectile hydra evil-collection evil general all-the-icons helpful ivy-rich which-key doom-modeline doom-themes counsel)))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )
#+end_src
* Packages
-----
#+begin_src emacs-lisp
(require 'package)
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
			 ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
 (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)
#+end_src
* General
-----
Where to store backups and some helpful packages. 
#+begin_src emacs-lisp
  ;; Write backups to ~/.emacs.d/backup/
  (setq backup-directory-alist '(("." . "~/.config/emacs/backup"))
        backup-by-copying      t  ; Don't de-link hard links
        version-control        t  ; Use version numbers on backups
        delete-old-versions    t  ; Automatically delete excess backups:
        kept-new-versions      20 ; how many of the newest versions to keep
        kept-old-versions      5) ; and how many of the old
  (setq create-lockfiles nil)

  (setq use-dialog-box nil)

  (setq global-auto-revert-non-file-buffers 1)
  (global-auto-revert-mode 1)

  (recentf-mode 1)

  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))

  (use-package counsel
    :bind (("M-x" . counsel-M-x)
           ("C-x b" . counsel-ibuffer)
           ("C-x C-f" . counsel-find-file)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history)))

  (counsel-mode 1)
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

#+end_src

* Basic UI config
-----
Disabling startup clutter, transparency etc.
#+begin_src emacs-lisp
  (setq initial-scratch-message nil)
  (setq inhibit-startup-screen t)

  (scroll-bar-mode -1)    
  (tool-bar-mode -1)
  (tooltip-mode -1)
  (set-fringe-mode 10)    ;padding
  (menu-bar-mode -1)
  (defun display-startup-echo-area-message ()
    (message ""))

  (column-number-mode)    ;line numbers
  (setq display-line-numbers t)
  (add-hook 'prog-mode-hook 'display-line-numbers-mode) ;displays line nums in programming modes

  (set-frame-parameter nil 'alpha-background 80)        ;transparency
  (add-to-list 'default-frame-alist '(alpha-background . 80))
  
  (use-package page-break-lines    ;pretty page breaks
    :diminish page-break-lines-mode
    :config (page-break-lines-mode))
#+end_src

** Theme and Font
#+begin_src emacs-lisp
  (use-package doom-themes
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))

  (set-face-attribute 'default nil :font "CaskaydiaMono Nerd Font Mono" :height 140 :weight 'normal)
  (load-theme 'doom-gruvbox)
  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1))
  (use-package all-the-icons)
#+end_src

** Dashboard
#+begin_src emacs-lisp
(defun gawmk/show-welcome-buffer ()
  "Show *Welcome* buffer."
  (with-current-buffer (get-buffer-create "*Welcome*")
    (setq truncate-lines t)
    (let* ((buffer-read-only)
           (image-path "~/pics/wallpapers/novigrad.png")
           (image (create-image image-path))
           (size (image-size image))
           (height (cdr size))
           (width (car size))
           (top-margin (floor (/ (- (window-height) height) 2)))
           (left-margin (floor (/ (- (window-width) width) 2)))
           (prompt-title "Welcome to Emacs!"))
      (erase-buffer)
      (setq mode-line-format nil)
      (goto-char (point-min))
      (insert (make-string top-margin ?\n ))
      (insert (make-string left-margin ?\ ))
      (insert-image image)
      (insert "\n\n\n")
      (insert (make-string (floor (/ (- (window-width) (string-width prompt-title)) 2)) ?\ ))
      (insert prompt-title))
    (setq cursor-type nil)
    (read-only-mode +1)
    (switch-to-buffer (current-buffer))
    (local-set-key (kbd "q") 'kill-this-buffer)))
(gawmk/show-welcome-buffer)
#+end_src

* Keybindings
-----
First and foremost - modify kb esc so that it does not kill the current buffer.
#+begin_src emacs-lisp
(defun keyboard-escape-quit ()
  "Exit the current \"mode\" (in a generalized sense of the word).
This command can exit an interactive command such as `query-replace',
can clear out a prefix argument or a region,
can get out of the minibuffer or other recursive edit,
cancel the use of the current buffer (for special-purpose buffers),
or go back to just one window (by deleting all but the selected window)."
  (interactive)
  (cond ((eq last-command 'mode-exited) nil)
    ((> (minibuffer-depth) 0)
     (abort-recursive-edit)
    (current-prefix-arg
     nil)
    ((and transient-mark-mode mark-active)
     (deactivate-mark))
    ((> (recursion-depth) 0)
     (exit-recursive-edit))
    (buffer-quit-function
     (funcall buffer-quit-function))
    ((string-match "^ \\*" (buffer-name (current-buffer)))
     (bury-buffer)))))
(bind-key* "C-c" 'keyboard-escape-quit)  ;C-c as escape
#+end_src

** General.el
#+begin_src emacs-lisp
  (use-package general
    :ensure t
    :config
    ;; allow for shorter bindings -- e.g., just using things like nmap alone without general-* prefix
    (general-evil-setup t)

    ;; To automatically prevent Key sequence starts with a non-prefix key errors without the need to
    ;; explicitly unbind non-prefix keys, you can add (general-auto-unbind-keys) to your configuration
    ;; file. This will advise define-key to unbind any bound subsequence of the KEY. Currently, this
    ;; will only have an effect for general.el key definers. The advice can later be removed with
    ;; (general-auto-unbind-keys t).
    (general-auto-unbind-keys)


    (general-create-definer gawmk/leader-key
      :states '(normal visual insert emacs)
      :keymaps 'override
      :prefix "SPC"
      :global-prefix "C-SPC")

    (gawmk/leader-key
      "pf" '(project-find-file :which-key "project management")
      "tt" '(launch-vterm :which-key "launch and rename vterm")
      "ff" '(counsel-find-file :which-key "find file")
      "rf" '(counsel-recentf :which-key "open recent file")
      "hf" '(counsel-describe-function :which-key "describe function")
      "hb" '(describe-bindings :which-key "describe bindings")
      "hv" '(counsel-describe-variable :which-key "describe variable")))

#+end_src

