.emacs.d/config.org
** Evil
#+begin_src emacs-lisp
    (use-package evil
      :init
      (setq evil-want-integration t)
      (setq evil-want-keybinding nil)
      (setq evil-want-C-u-scroll t)
      (setq evil-want-C-i-jump nil)
      :config
      (evil-set-undo-system 'undo-redo)
      (evil-mode 1)
      (define-key evil-motion-state-map (kbd "RET") nil)
      (define-key evil-insert-state-map (kbd "C-c") 'evil-normal-state)
      (define-key evil-normal-state-map (kbd "C-v") 'evil-visual-line)
      (define-key evil-normal-state-map (kbd "C-a") 'evil-append-line)
      (define-key evil-normal-state-map (kbd "L") 'evil-end-of-line)
      (define-key evil-normal-state-map (kbd "H") 'evil-beginning-of-line)
      ;; Use visual line motions even outside of visual-line-mode buffers
      (evil-global-set-key 'motion "j" 'evil-next-visual-line)
      (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

      (evil-set-initial-state 'messages-buffer-mode 'normal))

    (use-package evil-collection
      :after evil
      :config
      (evil-collection-init))
  
  (eval-after-load "evil-maps"
    (dolist (map '(evil-motion-state-map
                   evil-insert-state-map
                   evil-emacs-state-map))
      (define-key (eval map) "\C-w" nil)))
  (define-key global-map "\C-w" nil)
    #+end_src

** Hydra
#+begin_src emacs-lisp
  (use-package hydra)
  (defhydra hydra-text-scale (:timeout 3)
    "zoom"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("d" nil "done" :exit t))

  (defhydra hydra-resize-windows (:timeout 3)
    "resize windows"
    ("l" evil-window-increase-width "increase width")
    ("h" evil-window-decrease-width "decrease width")
    ("k" evil-window-increase-height "increase height")
    ("j" evil-window-decrease-height "decrease height")
    ("d" nil "done" :exit t))

  (gawmk/leader-key
    "ts" '(hydra-text-scale/body :which-key "scale text")
    "rw" '(hydra-resize-windows/body :which-key "resize windows"))
  
#+end_src
* Navigation
** Ivy
#+begin_src emacs-lisp
    (use-package ivy
      :diminish
      :bind (("C-s" . swiper)
             :map ivy-minibuffer-map
             ("TAB" . ivy-alt-done)	
             ("C-l" . ivy-alt-done)
             ("C-j" . ivy-next-line)
             ("C-k" . ivy-previous-line)
             :map ivy-switch-buffer-map
             ("C-k" . ivy-previous-line)
             ("C-l" . ivy-done)
             ("C-d" . ivy-switch-buffer-kill)
             :map ivy-reverse-i-search-map
             ("C-k" . ivy-previous-line)
             ("C-d" . ivy-reverse-i-search-kill))
      :init
      (ivy-mode 1))

    (use-package ivy-rich
      :init
      (ivy-rich-mode 1))

    (gawmk/leader-key
      "st" '(tab-switcher :which-key "switch tab"))

#+end_src
** Project
#+begin_src emacs-lisp
  (use-package project)
#+end_src
** Tab Bar and Window Management
#+begin_src emacs-lisp
  (use-package tab-bar)
  (tab-bar-mode 1)
  (define-prefix-command 'window-map)
  (bind-key* "C-w" 'window-map)

  (setq tab-bar-new-tab-choice "*Welcome*")
  (setq tab-bar-close-button-show nil
        tab-bar-new-button-show nil)
  ;; window navi

  (define-key window-map "h" 'evil-window-left)
  (define-key window-map "l" 'evil-window-right)
  (define-key window-map "j" 'evil-window-down)
  (define-key window-map "k" 'evil-window-up)

  ;; splits
  (define-key window-map "v" 'evil-window-vsplit)
  (define-key window-map "s" 'evil-window-split)

  ;; misc
  (define-key window-map "c" 'evil-window-delete)
  (define-key window-map "x" 'tab-bar-close-tab)
  (define-key window-map "=" 'balance-windows)

  ;; swapping windows
  (define-key window-map "H" 'evil-window-move-far-left)
  (define-key window-map "L" 'evil-window-move-far-right)
  (define-key window-map "J" 'evil-window-move-very-bottom)
  (define-key window-map "K" 'evil-window-move-very-top)

  ;; tab bar
  (define-key window-map "t"  'tab-bar-new-tab)
  (define-key window-map "rn" 'tab-bar-rename-tab)
  (define-key window-map "p"  'tab-bar-switch-to-recent-tab)


#+end_src
* Dired
#+begin_src emacs-lisp
  (use-package dired
    :ensure nil
    :custom ((dired-listing-switches "-aGho --group-directories-first"))
    :config
    (setf dired-kill-when-opening-new-dired-buffer t)
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-up-directory
      "l" 'dired-find-file))

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

  (use-package dired-open
    :config
    (setq dired-open-extensions '(("png" . "imv-wayland")
                                  ("mp4" . "mpv")
                                  ("jpeg" . "imv-wayland")
                                  ("jpg" . "imv-wayland"))))
  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "H" 'dired-hide-dotfiles-mode))
  (gawmk/leader-key 
    "dd" '(dired :which-key "open dired")
    "dp" '(project-dired :which-key "open dired project")
    "dj" '(dired-jump :which-key "dired jump"))
#+end_src
* Org
#+begin_src emacs-lisp
  (defun gawmk/org-mode-setup ()
    (org-indent-mode)
    (visual-line-mode 1))
  (use-package org
    :hook (org-mode . gawmk/org-mode-setup)
    :config
    (define-key org-mode-map (kbd "C-M-h") 'org-do-promote)
    (define-key org-mode-map (kbd "C-M-l") 'org-do-demote)
    (define-key org-mode-map (kbd "C-M-k") 'org-move-subtree-up)
    (define-key org-mode-map (kbd "C-M-j") 'org-move-subtree-down)

    (define-key org-mode-map (kbd "C-M-p") 'org-priority-down)
    (define-key org-mode-map (kbd "C-M-S-p") 'org-priority-up)
    
    (dolist (face '((org-level-1 . 1.3)
                    (org-level-2 . 1.12)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :weight 'bold :height (cdr face)))
    (keymap-set org-mode-map "C-c" nil)

    ;; visual stuff
    (setq org-ellipsis " ▾")
    (setq org-hide-emphasis-markers t)
    (setq org-pretty-entities t)

    ;; Follow the links
    (setq org-return-follows-link  t)

    ;; log mode
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t))

  ;; refile
  (setq org-refile-targets
        '(("~/org/archive.org" :maxlevel . 1)
          ("~/org/tasks.org" :maxlevel . 1)))

  ;; Save Org buffers after refiling!
  (advice-add 'org-refile :after 'org-save-all-org-buffers)


  (gawmk/leader-key
    "oa" '(org-agenda :which-key "org agenda")
    "oc" '(org-capture :which-key "org agenda")
    "oid" '(org-deadline :which-key "insert a deadline on a TODO")
    "oit" '(org-time-stamp :which-key "insert a timestamp on a TODO")
    "od" '(org-todo :which-key "cycle through TODO states")
    "ot" '(counsel-org-tag :which-key "insert a tag on a headline")
    "or" '(org-refile :which-key "move an org heading to a diff file")
    "osp" '(org-set-property :which-key "choose a property to set for an item")
    "ois" '(org-schedule :which-key "insert a scheduled tag on a TODO"))

  (setq org-capture-templates
        `(("t" "Task" entry  (file+headline "~/org/inbox.org" "Tasks")
           ,(concat "* TODO [#B] %?\n"
                    "/Entered on/ %U"))
          ("n" "Note"  entry (file+headline "~/org/inbox.org" "Notes")
           "** %?"
           :empty-lines 0)
          ("c" "Code To-Do"
           entry (file+headline "~/org/inbox.org" "Code Related Tasks")
           "* TODO [#B] %?\n:Created: %T\n%i\n%a\nProposed Solution: "
           :empty-lines 0)
          ))

  ;; TODO states
  (setq org-todo-keywords
        '((sequence "TODO(t)" "PLANNING(p)" "IN-PROGRESS(i)" "|" "DONE(d)")
          ))

  ;; auto insert mode when capturing
  (add-hook 'org-capture-mode-hook 'evil-insert-state)

  ;; TODO colors
  (setq org-todo-keyword-faces
        '(
          ("TODO" . (:foreground "#d6523e" :weight bold))
          ("PLANNING" . (:foreground "DeepPink" :weight bold))
          ("IN-PROGRESS" . (:foreground "GoldenRod" :weight bold))
          ("DONE" . (:foreground "LimeGreen" :weight bold))
          ))

  (setq org-priority-faces
        '(
          (?A . (:foreground "Grey"))
          (?B . (:foreground "Grey"))
          (?C . (:foreground "Grey"))))

  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode))

  (defun gawmk/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . gawmk/org-mode-visual-fill))

#+end_src
