.emacs.d/config.org
**  Org Agenda
#+begin_src emacs-lisp
  ;; agenda settings
  (setq org-agenda-files '("~/org"))
  (setq org-agenda-restore-windows-after-quit t)

  ;; custom agenda commands

;; Agenda View "d"
(defun air-org-skip-subtree-if-priority (priority)
  "Skip an agenda subtree if it has a priority of PRIORITY.

  PRIORITY may be one of the characters ?A, ?B, or ?C."
  (let ((subtree-end (save-excursion (org-end-of-subtree t)))
        (pri-value (* 1000 (- org-lowest-priority priority)))
        (pri-current (org-get-priority (thing-at-point 'line t))))
    (if (= pri-value pri-current)
        subtree-end
      nil)))

(setq org-agenda-skip-deadline-if-done t)

(setq org-agenda-custom-commands
      '(
        ;; Daily Agenda & TODOs
        ("d" "Daily agenda and all TODOs"

         ;; Display items with priority A
         ((tags "PRIORITY=\"A\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "High-priority unfinished tasks:")))

          ;; View 7 days in the calendar view
          (agenda "" ((org-agenda-span 7)))

          ;; Display items with priority B (really it is view all items minus A & C)
          (tags "PRIORITY=\"A\""
                   ((org-agenda-skip-function '(or (air-org-skip-subtree-if-priority ?A)
                                                   (air-org-skip-subtree-if-priority ?C)
                                                   (org-agenda-skip-if nil '(scheduled deadline))))
                    (org-agenda-overriding-header "ALL normal priority tasks:")))

          ;; Display items with pirority C
          (tags "PRIORITY=\"C\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Low-priority Unfinished tasks:")))
          )

         ;; Don't compress things (change to suite your tastes)
         ((org-agenda-compact-blocks nil)))
        ))

  ;; agenda keybinds
  (eval-after-load 'org-agenda
    '(progn
       (evil-set-initial-state 'org-agenda-mode 'normal)
       (evil-define-key 'normal org-agenda-mode-map
         (kbd "<RET>") 'org-agenda-switch-to
         (kbd "\t") 'org-agenda-goto

         "q" 'org-agenda-quit
         "r" 'org-agenda-refile
         "C-r" 'org-agenda-redo
         "S" 'org-save-all-org-buffers
         "+" 'org-agenda-priority-up
         "," 'org-agenda-priority
         "-" 'org-agenda-priority-down
         "d" 'org-agenda-todo
         ":" 'org-agenda-set-tags
         ";" 'org-timer-set-timer
         "j"  'org-agenda-next-line
         "k"  'org-agenda-previous-line)))


  ;; evil calendar
  (defmacro my-org-in-calendar (command)
    (let ((name (intern (format "my-org-in-calendar-%s" command))))
      `(progn
         (defun ,name ()
           (interactive)
           (org-eval-in-calendar '(call-interactively #',command)))
         #',name)))

  (general-def org-read-date-minibuffer-local-map
    "C-h" (my-org-in-calendar calendar-backward-day)
    "C-l" (my-org-in-calendar calendar-forward-day)
    "C-k" (my-org-in-calendar calendar-backward-week)
    "C-j" (my-org-in-calendar calendar-forward-week)
    "C-S-h" (my-org-in-calendar calendar-backward-month)
    "C-S-l" (my-org-in-calendar calendar-forward-month)
    "C-S-k" (my-org-in-calendar calendar-backward-year)
    "C-S-j" (my-org-in-calendar calendar-forward-year))

#+end_src

**  Babel
#+begin_src emacs-lisp
    (setq org-babel-python-command "python3")
    (setq org-confirm-babel-evaluate nil)
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python . t)))

    (require 'org-tempo)
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))

    ;; tangle on save
    (defun gawmk/org-babel-tangle-config ()
      (when (string-equal (buffer-file-name)
                          (expand-file-name "~/dotfiles/.emacs.d/config.org"))
        ;; Dynamic scoping to the rescue
        (let ((org-confirm-babel-evaluate nil))
          (org-babel-tangle))))

    (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'gawmk/org-babel-tangle-config)))
  
#+END_SRC
* Terminal
#+begin_src emacs-lisp
  (use-package vterm
    :ensure t
    :config
    (with-eval-after-load 'evil
      (evil-set-initial-state 'vterm-mode 'insert))
    (setq vterm-timer-delay 0.01)
    (keymap-set vterm-mode-map "<insert-state> C-c" 'vterm--self-insert))
    (keymap-set vterm-mode-map "<insert-state> C-w" 'window-map)

    
  (defun launch-vterm (buffer-name)
    "Start a terminal and rename buffer."
    (interactive "sbuffer name: ")
    (vterm)
    (rename-buffer buffer-name t))


#+end_src

* Magit

#+begin_src emacs-lisp
  (use-package magit)

  (gawmk/leader-key
    "mg" '(magit-status :which-key "magit status pane")
    "cmg" '(magit-clone :which-key "clone a repository"))
#+end_src

* PDF
#+begin_src emacs-lisp

  (use-package pdf-tools
    :defer t
    :commands (pdf-loader-install)
    ;;:mode "\\.pdf\\"
    :bind (:map pdf-view-mode-map
                ("j" . pdf-view-next-line-or-next-page)
                ("k" . pdf-view-previous-line-or-next-page)
                ("C-+" . pdf-view-enlarge)
                ("C--" . pdf-view-shrink))
    :init (pdf-loader-install)
    :config (add-to-list 'revert-without-query ".pdf"))

  (add-hook 'pdf-view-mode-hook #'(lambda () (interactive) (display-line-numbers-mode -1) (blink-cursor-mode -1) (line-number-mode -1)))
#+end_src

* Eglot
#+begin_src emacs-lisp
  (use-package eglot
    :config
    (fset #'jsonrpc--log-event #'ignore)
    (add-hook 'c-mode-hook #'eglot-ensure))

  ;; (use-package eglot-booster
  ;;      :after eglot
  ;;      :config (eglot-booster-mode))
#+end_src

