.emacs.d/init.el

;; agenda settings
(setq org-agenda-files '("~/org"))
(setq org-agenda-restore-windows-after-quit t)


;; custom agenda commands
(setq org-agenda-custom-commands
      '(
        ("W" "Work tasks" tags-todo "+work")))

;; agenda keybinds
(eval-after-load 'org-agenda
  '(progn
     (evil-set-initial-state 'org-agenda-mode 'normal)
     (evil-define-key 'normal org-agenda-mode-map
       (kbd "<RET>") 'org-agenda-switch-to
       (kbd "\t") 'org-agenda-goto

       "q" 'org-agenda-quit
       "C-r" 'org-agenda-redo
       "S" 'org-save-all-org-buffers
       "+" 'org-agenda-priority-up
       "," 'org-agenda-priority
       "-" 'org-agenda-priority-down
       "d" 'org-agenda-todo
       ":" 'org-agenda-set-tags
       ";" 'org-timer-set-timer
       "j"  'org-agenda-next-line
       "k"  'org-agenda-previous-line)))


;; evil calendar
(defmacro my-org-in-calendar (command)
  (let ((name (intern (format "my-org-in-calendar-%s" command))))
    `(progn
       (defun ,name ()
         (interactive)
         (org-eval-in-calendar '(call-interactively #',command)))
       #',name)))

(general-def org-read-date-minibuffer-local-map
  "C-h" (my-org-in-calendar calendar-backward-day)
  "C-l" (my-org-in-calendar calendar-forward-day)
  "C-k" (my-org-in-calendar calendar-backward-week)
  "C-j" (my-org-in-calendar calendar-forward-week)
  "C-S-h" (my-org-in-calendar calendar-backward-month)
  "C-S-l" (my-org-in-calendar calendar-forward-month)
  "C-S-k" (my-org-in-calendar calendar-backward-year)
  "C-S-j" (my-org-in-calendar calendar-forward-year))

(setq org-babel-python-command "python3")
(setq org-confirm-babel-evaluate nil)
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)))

(require 'org-tempo)
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))

;; tangle on save
(defun gawmk/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/dotfiles/.emacs.d/config.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'gawmk/org-babel-tangle-config)))

(use-package vterm
  :ensure t
  :config
  (with-eval-after-load 'evil
    (evil-set-initial-state 'vterm-mode 'insert))
  (setq vterm-timer-delay 0.01)
  (keymap-set vterm-mode-map "<insert-state> C-c" 'vterm--self-insert))
  (keymap-set vterm-mode-map "<insert-state> C-w" 'window-map)


(defun launch-vterm (buffer-name)
  "Start a terminal and rename buffer."
  (interactive "sbuffer name: ")
  (vterm)
  (rename-buffer buffer-name t))

(use-package magit)

(gawmk/leader-key
  "mg" '(magit-status :which-key "magit status pane"))
